---
format:
  html:
    title: "Python LevelUP: Data Science by Appsilon"
    subtitle: "Week 2 - Pandas"
    author: Piotr Pasza Storożenko
    self-contained: true
    theme:
        dark: darkly
        light: flatly
    toc: true
    shift-heading-level-by: -1
    number-sections: true

---

![](images/baner.png)

**Week 2 - Pandas**

In data science we rarely work on raw numbers, usually they are in the form of dataframe.
Pandas is the _go-to_ library to work with dataframes in python.

Pandas has a great documentation with lots of examples in [a cookbook](https://pandas.pydata.org/docs/user_guide/cookbook.html).

I definitely recommend to go through the [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html) official tutorial.

In [261]:
import numpy as np
import pandas as pd

## Reading data frames and creating new ones

### The simplest way to create a dataframe

Just pass a `dict` with `str` keys and some array-like things as values.

In [262]:
{
    "column_name1": [1, 2, 3],
    "column_name2": np.random.rand(3),
    # pandas has a build-in support for dates
    "column_date": pd.date_range("2022-02-24", periods=3, freq="S"),
}

{'column_name1': [1, 2, 3],
 'column_name2': array([0.96990985, 0.83244264, 0.21233911]),
 'column_date': DatetimeIndex(['2022-02-24 00:00:00', '2022-02-24 00:00:01',
                '2022-02-24 00:00:02'],
               dtype='datetime64[ns]', freq='S')}

In [263]:
pd.DataFrame({
    "column_name1": [1, 2, 3],
    "column_name2": np.random.rand(3),
    # pandas has a build-in support for dates
    "column_date": pd.date_range("2022-02-24", periods=3, freq="S"),
})

   column_name1  column_name2         column_date
0             1      0.181825 2022-02-24 00:00:00
1             2      0.183405 2022-02-24 00:00:01
2             3      0.304242 2022-02-24 00:00:02

### Reading CSV-like file

The most common scenario is to receive data in CSV-like file.
Then you can just use the default `pd.read_csv` function.

First let's look how does the file look like:

In [22]:
!head -5 data/iris.csv

"sepal.length","sepal.width","petal.length","petal.width","variety"
5.1,3.5,1.4,.2,"Setosa"
4.9,3,1.4,.2,"Setosa"
4.7,3.2,1.3,.2,"Setosa"
4.6,3.1,1.5,.2,"Setosa"

And now read it:

In [30]:
iris = pd.read_csv("data/iris.csv")
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

Sometimes you may encounter tsv files, which have tabs instead of commas.
In such case you have to pass additional `sep` parameter.

In [31]:
!head -5 data/iris.tsv

sepal.length	sepal.width	petal.length	petal.width	variety
5.1	3.5	1.4	0.2	Setosa
4.9	3.0	1.4	0.2	Setosa
4.7	3.2	1.3	0.2	Setosa
4.6	3.1	1.5	0.2	Setosa

In [265]:
pd.read_csv("data/iris.tsv", sep="\t").head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

In [266]:
pd.read_csv("data/iris.tsv", sep="\t").tail(3)

     sepal.length  sepal.width  petal.length  petal.width    variety
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

Beware that in Poland we use semicolons `;` in csv files since commas `,` are used as dots `.` in decimal numbers!
This often may cause some problems.
You can specify decimal separator with `df = pd.read_csv(FILE_PATH, sep=";", decimal=",")`.

Not always obtained csv file has header, in such cases you may want to provide the column names on dataframe read.

In [33]:
!head -5 data/iris_noheader.csv

5.1,3.5,1.4,.2,"Setosa"
4.9,3,1.4,.2,"Setosa"
4.7,3.2,1.3,.2,"Setosa"
4.6,3.1,1.5,.2,"Setosa"
5,3.6,1.4,.2,"Setosa"

In [35]:
# Wrong columns names!
pd.read_csv("data/iris_noheader.csv").head(3)

   5.1  3.5  1.4   .2  Setosa
0  4.9  3.0  1.4  0.2  Setosa
1  4.7  3.2  1.3  0.2  Setosa
2  4.6  3.1  1.5  0.2  Setosa

In [37]:
names = ["sepal.length", "sepal.width", "petal.length", "petal.width", "variety"]
pd.read_csv("data/iris_noheader.csv", names=names).head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

Another `pd.read_csv` parameters worth mentioning:

- `header`
- `skiprows`
- `nrows`
- `parse_dates`

### Reading excel files

Unfortunately it's not uncommon to receive data in excel format.
These format is much slower to read from and should never be preferred.

Excel is not purely tabular format as you can merge different cells add plots and so on, but pandas handles it pretty well.

In [41]:
pd.read_excel("data/iris.xlsx").head(3)

   sepal.length  sepal.width  petal.length  petal.width variety
0           5.1          3.5           1.4          0.2  Setosa
1           4.9          3.0           1.4          0.2  Setosa
2           4.7          3.2           1.3          0.2  Setosa

## Basic functions on dataframe

Without further ado, just execute them.

In [89]:
iris.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal.length  150 non-null    float64
 1   sepal.width   150 non-null    float64
 2   petal.length  150 non-null    float64
 3   petal.width   150 non-null    float64
 4   variety       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [90]:
iris.describe()

       sepal.length  sepal.width  petal.length  petal.width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [267]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [91]:
iris.sum()

sepal.length                                                876.5
sepal.width                                                 458.6
petal.length                                                563.7
petal.width                                                 179.9
variety         SetosaSetosaSetosaSetosaSetosaSetosaSetosaSeto...
dtype: object

In [92]:
iris.mean()

/tmp/ipykernel_15066/935066809.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  iris.mean()

sepal.length    5.843333
sepal.width     3.057333
petal.length    3.758000
petal.width     1.199333
dtype: float64

In [102]:
iris.max()

sepal.length          7.9
sepal.width           4.4
petal.length          6.9
petal.width           2.5
variety         Virginica
dtype: object

Select single column with:

In [116]:
iris['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [100]:
iris.sort_values("sepal.length").head(5)

    sepal.length  sepal.width  petal.length  petal.width variety
13           4.3          3.0           1.1          0.1  Setosa
42           4.4          3.2           1.3          0.2  Setosa
38           4.4          3.0           1.3          0.2  Setosa
8            4.4          2.9           1.4          0.2  Setosa
41           4.5          2.3           1.3          0.3  Setosa

In [101]:
iris.sort_values("sepal.length", ascending=False).head(5)

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
118           7.7          2.6           6.9          2.3  Virginica

In [103]:
iris.sort_values(["sepal.length", 'sepal.width'], ascending=False).head(5)

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
118           7.7          2.6           6.9          2.3  Virginica

In [104]:
# Trick to split _query_ in multiple lines
(iris
.sort_values(
    [
        "sepal.length", 
        'sepal.width',
    ], ascending=False)
.head(5))

     sepal.length  sepal.width  petal.length  petal.width    variety
131           7.9          3.8           6.4          2.0  Virginica
117           7.7          3.8           6.7          2.2  Virginica
135           7.7          3.0           6.1          2.3  Virginica
122           7.7          2.8           6.7          2.0  Virginica
118           7.7          2.6           6.9          2.3  Virginica

## `pd.Dataframe` and `pd.Series`

The two key concepts for storing data in pandas are `pd.Dataframe` and `pd.Series`.

In [115]:
iris

     sepal.length  sepal.width  petal.length  petal.width    variety
0             5.1          3.5           1.4          0.2     Setosa
1             4.9          3.0           1.4          0.2     Setosa
2             4.7          3.2           1.3          0.2     Setosa
3             4.6          3.1           1.5          0.2     Setosa
4             5.0          3.6           1.4          0.2     Setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  Virginica
146           6.3          2.5           5.0          1.9  Virginica
147           6.5          3.0           5.2          2.0  Virginica
148           6.2          3.4           5.4          2.3  Virginica
149           5.9          3.0           5.1          1.8  Virginica

[150 rows x 5 columns]

In [105]:
type(iris)

pandas.core.frame.DataFrame

In [114]:
iris['sepal.length']

0      5.1
1      4.9
2      4.7
3      4.6
4      5.0
      ...
145    6.7
146    6.3
147    6.5
148    6.2
149    5.9
Name: sepal.length, Length: 150, dtype: float64

In [117]:
type(iris['sepal.length'])

pandas.core.series.Series

`pd.Dataframe` is like a whole... dataframe. Has many rows, some columns. `pd.Series` is like **an array**. 

**Each column** of dataframe is a separate `pd.Series` object!

Actually, `pd.Series` is not only an array, it's a wrapper around `np.ndarray`! So all methods and techniques we've learned apply here!

In VS Code and jupyter notebooks we can visually distinguish between series and dataframes as series dataframe are _fancier_.

You can create Series similarly to the ndarray.

In [121]:
pd.Series([1, 2, 3])

0    1
1    2
2    3
dtype: int64

In [122]:
pd.Series(np.random.rand(4))

0    0.029965
1    0.357006
2    0.702349
3    0.091511
dtype: float64

As we see, each `pd.Series` has a particular data type. 
This is important to remember.

Pandas has two ways of storing strings:

1. The old way, as `object` class. This is pretty general class and is here only for backwards compatibility.
2. As `pd.StringDtype()` aka pandas `string`. Special format that is faster and can easily handle `NA` values.

In [125]:
pd.Series(["Time", "flies", "like", "an", "arrow", "."])

0     Time
1    flies
2     like
3       an
4    arrow
5        .
dtype: object

In [128]:
pd.Series(["Time", "flies", "like", "an", "arrow", "."], dtype="string")

0     Time
1    flies
2     like
3       an
4    arrow
5        .
dtype: string

### Picking a column

Nothing fancy here, we just want to pick a column.

In all cases we can index `df` with the name of the column like so:

In [32]:
iris['sepal.width']

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal.width, Length: 150, dtype: float64

Sometimes, if the column has _nice_ name we can access it like a field.

In [34]:
iris.sepal.width  # sepal.width has a dot in the middle is not a nice name

AttributeError: 'DataFrame' object has no attribute 'sepal'

In [36]:
iris.variety  # variety is a nice name

0         Setosa
1         Setosa
2         Setosa
3         Setosa
4         Setosa
         ...
145    Virginica
146    Virginica
147    Virginica
148    Virginica
149    Virginica
Name: variety, Length: 150, dtype: object

## Indexing dataframes and series

One last piece before we can utilize dataframes is how to index them.
It is not that obvious as in case of `ndarray`s so pay close attention.

In [272]:
df = pd.DataFrame({
    'a': [1, 2, 3],
    'b': [4, 5, 6],
    'c': ["A", "B", "C"],
})
df

   a  b  c
0  1  4  A
1  2  5  B
2  3  6  C

`.iloc[]` stands for integer-location.

In [273]:
df.iloc[2, 0]  # Element from 3nd row and 1st column

3

In [274]:
df.iloc[:, 0]  # 1st column

0    1
1    2
2    3
Name: a, dtype: int64

In [275]:
# 1st row - this is rarely used as dataframes are column-oriented
df.iloc[0, :]

a    1
b    4
c    A
Name: 0, dtype: object

In [276]:
df.iloc[::2, :]  # every other element from every column

   a  b  c
0  1  4  A
2  3  6  C

In [277]:
df.iloc[[1, 2], :]  # elements from rows 1 and 2

   a  b  c
1  2  5  B
2  3  6  C

In [278]:
# It all works similarly on series except they are one dimensional
s = df['a']
s

0    1
1    2
2    3
Name: a, dtype: int64

In [279]:
s.iloc[[0, 2]]

0    1
2    3
Name: a, dtype: int64

`.loc[]` stands for location. It is used more often as you will see in examples.

We can index dataframe with vector of truths and falses.

In [280]:
df.loc[[True, False, True], :]

   a  b  c
0  1  4  A
2  3  6  C

But we can also use **columns names**.

In [15]:
df.loc[[True, False, True], 'a']

0    1
2    3
Name: a, dtype: int64

Apart from working with boolean values, `.loc[]` works with **pandas indexes**. Just keep that in mind for now.

## Querying dataframes

I would say there are 3 core functionalities dataframe handling package should take care of:

1. Querying
2. Grouping/Summarizing
3. Merging/Joining

Finally we can utility pandas to do something useful!
And it should have a lot of smaller functionalities to support these functionalities.

Let's not work on `iris` dataset as it's boring, and load sample of `flights` instead!
`flights` dataset have information on all US domestic flights in 2015.
We will now work on a sample of this data from Q1 with all flights destined to JFK airport (one of the largest in the US).

In [157]:
flights = pd.read_csv("../data/flights_Q1_JFK.csv")
flights

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
0,2015,1,1,4,B6,304,N607JB,SJU,JFK,155,...,501.0,11.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
1,2015,1,1,4,B6,2001,N358JB,BUF,JFK,535,...,648.0,-15.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
2,2015,1,1,4,B6,2807,N190JB,PWM,JFK,535,...,635.0,-25.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
3,2015,1,1,4,B6,917,N606JB,BOS,JFK,545,...,649.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
4,2015,1,1,4,B6,115,N284JB,SYR,JFK,555,...,705.0,-13.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25032,2015,3,31,2,AA,30,N790AA,LAX,JFK,2325,...,758.0,-1.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25033,2015,3,31,2,DL,1264,N692DL,SLC,JFK,2340,...,540.0,-18.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25034,2015,3,31,2,B6,624,N934JB,LAX,JFK,2345,...,807.0,7.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25035,2015,3,31,2,B6,66,N784JB,ABQ,JFK,2349,...,533.0,-14.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN
25036,2015,3,31,2,B6,98,N646JB,DEN,JFK,2358,...,528.0,-5.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN

In [159]:
flights.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25037 entries, 0 to 25036
Data columns (total 31 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   YEAR                 25037 non-null  int64
 1   MONTH                25037 non-null  int64
 2   DAY                  25037 non-null  int64
 3   DAY_OF_WEEK          25037 non-null  int64
 4   AIRLINE              25037 non-null  object
 5   FLIGHT_NUMBER        25037 non-null  int64
 6   TAIL_NUMBER          24891 non-null  object
 7   ORIGIN_AIRPORT       25037 non-null  object
 8   DESTINATION_AIRPORT  25037 non-null  object
 9   SCHEDULED_DEPARTURE  25037 non-null  int64
 10  DEPARTURE_TIME       23693 non-null  float64
 11  DEPARTURE_DELAY      23693 non-null  float64
 12  TAXI_OUT             23679 non-null  float64
 13  WHEELS_OFF           23679 non-null  float64
 14  SCHEDULED_TIME       25037 non-null  float64
 15  ELAPSED_TIME         23561 non-null  float64
 16  AIR_TIME             23561 non-null  float64
 17  DISTANCE             25037 non-null  int64
 18  WHEELS_ON            23657 non-null  float64
 19  TAXI_IN              23657 non-null  float64
 20  SCHEDULED_ARRIVAL    25037 non-null  int64
 21  ARRIVAL_TIME         23657 non-null  float64
 22  ARRIVAL_DELAY        23561 non-null  float64
 23  DIVERTED             25037 non-null  int64
 24  CANCELLED            25037 non-null  int64
 25  CANCELLATION_REASON  1363 non-null   object
 26  AIR_SYSTEM_DELAY     6519 non-null   float64
 27  SECURITY_DELAY       6519 non-null   float64
 28  AIRLINE_DELAY        6519 non-null   float64
 29  LATE_AIRCRAFT_DELAY  6519 non-null   float64
 30  WEATHER_DELAY        6519 non-null   float64
dtypes: float64(16), int64(10), object(5)
memory usage: 5.9+ MB

Let's say we want to find flights that were delayed by more than 60 minute.

In [160]:
flights['ARRIVAL_DELAY'] > 60  # Reminder, pd.Series is nd.array

0        False
1        False
2        False
3        False
4        False
         ...
25032    False
25033    False
25034    False
25035    False
25036    False
Name: ARRIVAL_DELAY, Length: 25037, dtype: bool

In [161]:
flights.loc[flights['ARRIVAL_DELAY'] > 60, :]

,YEAR,MONTH,DAY,DAY_OF_WEEK,AIRLINE,FLIGHT_NUMBER,TAIL_NUMBER,ORIGIN_AIRPORT,DESTINATION_AIRPORT,SCHEDULED_DEPARTURE,...,ARRIVAL_TIME,ARRIVAL_DELAY,DIVERTED,CANCELLED,CANCELLATION_REASON,AIR_SYSTEM_DELAY,SECURITY_DELAY,AIRLINE_DELAY,LATE_AIRCRAFT_DELAY,WEATHER_DELAY
22,2015,1,1,4,MQ,3432,N546MQ,DCA,JFK,615,...,959.0,161.0,0,0,NaN,0.0,46.0,115.0,0.0,0.0
37,2015,1,1,4,DL,1994,N3758Y,PHX,JFK,715,...,1501.0,71.0,0,0,NaN,0.0,0.0,0.0,0.0,71.0
54,2015,1,1,4,DL,414,N710TW,SFO,JFK,830,...,1818.0,83.0,0,0,NaN,0.0,0.0,83.0,0.0,0.0
61,2015,1,1,4,AA,164,N790AA,SFO,JFK,850,...,2044.0,194.0,0,0,NaN,1.0,0.0,193.0,0.0,0.0
94,2015,1,1,4,AA,2393,N3APAA,MCO,JFK,1055,...,1507.0,102.0,0,0,NaN,0.0,0.0,0.0,102.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
24694,2015,3,30,1,B6,84,N598JB,MCO,JFK,1840,...,2325.0,120.0,0,0,NaN,0.0,0.0,63.0,57.0,0.0
24717,2015,3,30,1,AA,1406,N3KFAA,MIA,JFK,2105,...,228.0,141.0,0,0,NaN,0.0,0.0,89.0,52.0,0.0
24891,2015,3,31,2,MQ,3145,N655MQ,CMH,JFK,1233,...,1544.0,81.0,0,0,NaN,1.0,0.0,21.0,59.0,0.0
24898,2015,3,31,2,MQ,3026,N638MQ,BWI,JFK,1245,...,1456.0,64.0,0,0,NaN,44.0,0.0,20.0,0.0,0.0
25022,2015,3,31,2,UA,824,N597UA,SFO,JFK,2230,...,755.0,61.0,0,0,NaN,1.0,0.0,60.0,0.0,0.0

What if we don't want to see all those columns?
Let's pick just `YEAR, MONTH, DAY, SCHEDULED_DEPARTURE, ORIGIN_AIRPORT, ARRIVAL_DELAY`.

In [281]:
interesting_cols_list = ["YEAR", "MONTH", "DAY", "SCHEDULED_DEPARTURE", "ORIGIN_AIRPORT", "ARRIVAL_DELAY"]
flights.loc[flights['ARRIVAL_DELAY'] > 60, interesting_cols_list]

       YEAR  MONTH  DAY  SCHEDULED_DEPARTURE ORIGIN_AIRPORT  ARRIVAL_DELAY
22     2015      1    1                  615            DCA          161.0
37     2015      1    1                  715            PHX           71.0
54     2015      1    1                  830            SFO           83.0
61     2015      1    1                  850            SFO          194.0
94     2015      1    1                 1055            MCO          102.0
...     ...    ...  ...                  ...            ...            ...
24694  2015      3   30                 1840            MCO          120.0
24717  2015      3   30                 2105            MIA          141.0
24891  2015      3   31                 1233            CMH           81.0
24898  2015      3   31                 1245            BWI           64.0
25022  2015      3   31                 2230            SFO           61.0

[2456 rows x 6 columns]

Now we might wonder whether delays are longer in the evening (after 18:00) or in the morning (before 12:00).

In [282]:
# Reminder, use additional parenthesis ()!
morning_flights = flights.loc[(flights['ARRIVAL_DELAY'] > 60) & (flights['SCHEDULED_DEPARTURE'] <= 1200), interesting_cols_list]
evening_flights = flights.loc[(flights['ARRIVAL_DELAY'] > 60) & (flights['SCHEDULED_DEPARTURE'] >= 1800), interesting_cols_list]

In [285]:
morning_flights['ARRIVAL_DELAY'].mean()

141.3235800344234

In [49]:
morning_flights['ARRIVAL_DELAY'].mean(), morning_flights['ARRIVAL_DELAY'].std()

(141.3235800344234, 113.5697960010186)

In [51]:
evening_flights['ARRIVAL_DELAY'].mean(), evening_flights['ARRIVAL_DELAY'].std()

(121.10404624277457, 65.67715306804766)

Top three busiest airports in the US in 2020 were:

1. Hartsfield–Jackson Atlanta International Airport	College Park, Georgia	ATL
2. Dallas/Fort Worth International Airport	Irving, Texas	DFW		
3. Denver International Airport	Denver, Colorado	DEN

Let's count number of flights from them to JFK in 2015Q1.

In [286]:
flights.shape

(25037, 33)

In [287]:
for airport in ['ATL', 'DFW', 'DEN']:
    n = flights.loc[flights['ORIGIN_AIRPORT'] == airport, :].shape[0]
    print(f"N flights from {airport} to JFK equaled {n} in 2015Q1")

N flights from ATL to JFK equaled 449 in 2015Q1
N flights from DFW to JFK equaled 98 in 2015Q1
N flights from DEN to JFK equaled 168 in 2015Q1

What are 10 longest (in terms of distance) flights that landed on JFK in 2015Q1?
Show only data, origin airport and distance.

In [165]:
(
    flights
    .loc[:, ['YEAR', 'MONTH', 'DAY', 'ORIGIN_AIRPORT', 'DISTANCE']]
    .sort_values("DISTANCE", ascending=False)
    .head(10)
)

       YEAR  MONTH  DAY ORIGIN_AIRPORT  DISTANCE
11910  2015      2   13            HNL      4983
16123  2015      2   28            HNL      4983
15854  2015      2   27            HNL      4983
14146  2015      2   21            HNL      4983
5963   2015      1   22            HNL      4983
3817   2015      1   14            HNL      4983
13300  2015      2   18            HNL      4983
782    2015      1    3            HNL      4983
15565  2015      2   26            HNL      4983
1069   2015      1    4            HNL      4983

Well, that's not what we wanted. These are different flights from HNL - Honolulu, we want distinct origins.
We see that asking for particular date doesn't make sense here.
Let's just ask for the origin and distance.

In [290]:
ten_longest = (flights
.loc[:, ["ORIGIN_AIRPORT", "DISTANCE"]]
.drop_duplicates()  # useful function
.sort_values("DISTANCE", ascending=False)
.head(10)
)
ten_longest

    ORIGIN_AIRPORT  DISTANCE
194            HNL      4983
23             SFO      2586
250            OAK      2576
269            SJC      2569
273            SMF      2521
20             LAX      2475
257            BUR      2465
79             LGB      2465
29             PDX      2454
24             SAN      2446

That's more what we wanted!
Now, what is the number of flights for every airport in that list?

In [291]:
for airport in ten_longest['ORIGIN_AIRPORT']:
    n = flights.loc[flights['ORIGIN_AIRPORT'] == airport, :].shape[0]
    print(f"N flights from {airport} to JFK equaled {n} in 2015Q1")

N flights from HNL to JFK equaled 80 in 2015Q1
N flights from SFO to JFK equaled 2216 in 2015Q1
N flights from OAK to JFK equaled 53 in 2015Q1
N flights from SJC to JFK equaled 54 in 2015Q1
N flights from SMF to JFK equaled 55 in 2015Q1
N flights from LAX to JFK equaled 3312 in 2015Q1
N flights from BUR to JFK equaled 90 in 2015Q1
N flights from LGB to JFK equaled 143 in 2015Q1
N flights from PDX to JFK equaled 162 in 2015Q1
N flights from SAN to JFK equaled 370 in 2015Q1

We are playing around origin airports, but from which airport came the most flights to JFK? Name top 10

In [292]:
flights['ORIGIN_AIRPORT']

0        SJU
1        BUF
2        PWM
3        BOS
4        SYR
        ...
25032    LAX
25033    SLC
25034    LAX
25035    ABQ
25036    DEN
Name: ORIGIN_AIRPORT, Length: 25037, dtype: object

In [293]:
flights['ORIGIN_AIRPORT'].value_counts().head(10)

LAX    3312
SFO    2216
MCO    1400
FLL    1387
BOS    1355
SJU    1226
LAS     968
MIA     963
TPA     751
CLT     694
Name: ORIGIN_AIRPORT, dtype: int64

Now we would like to know when there are more scheduled flights, in the first half of an hour or in the second?
To do so we will **create** additional columns to already existing dataframe.

In [295]:
flights['SCHEDULED_DEPARTURE'] % 100

0        55
1        35
2        35
3        45
4        55
         ..
25032    25
25033    40
25034    45
25035    49
25036    58
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [296]:
flights['SCHEDULED_DEPARTURE'] // 100

0         1
1         5
2         5
3         5
4         5
         ..
25032    23
25033    23
25034    23
25035    23
25036    23
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [298]:
flights['SCHEDULED_DEPARTURE']

0         155
1         535
2         535
3         545
4         555
         ...
25032    2325
25033    2340
25034    2345
25035    2349
25036    2358
Name: SCHEDULED_DEPARTURE, Length: 25037, dtype: int64

In [299]:
flights['SCHEDULED_DEPARTURE_MINUTE']

0        55
1        35
2        35
3        45
4        55
         ..
25032    25
25033    40
25034    45
25035    49
25036    58
Name: SCHEDULED_DEPARTURE_MINUTE, Length: 25037, dtype: int64

In [297]:
flights['SCHEDULED_DEPARTURE_MINUTE'] < 30

0        False
1        False
2        False
3        False
4        False
         ...
25032     True
25033    False
25034    False
25035    False
25036    False
Name: SCHEDULED_DEPARTURE_MINUTE, Length: 25037, dtype: bool

In [169]:
flights['SCHEDULED_DEPARTURE_MINUTE'] = flights['SCHEDULED_DEPARTURE'] % 100
flights['SCHEDULED_DEPARTURE_HOUR'] = flights['SCHEDULED_DEPARTURE'] // 100
(flights['SCHEDULED_DEPARTURE_MINUTE'] < 30).mean()

0.5036945320925031

The percentage of flights in the first half of an hour seems to be almost equal 50%.

## Pandas indexes

It's time to step back and do some pre-work.
An important idea in pandas that is different from `dplyr`, `data.table`, `Dataframes.jl` is `pd.Index`.
Not always it's an integer index!

Each row and column has an index. In both dataframe and series.

In [300]:
np.random.seed(42)
df = pd.DataFrame({
    'a': np.r_[-10:10:11j],
    'b': np.random.rand(11),
    'c': pd.date_range("2022-02-24", periods=11, freq="D"),
    'd': pd.date_range("2020-02-24", periods=11, freq="D"),
})
df  # dates are of course _smart_, leap-year aware

       a         b          c          d
0  -10.0  0.374540 2022-02-24 2020-02-24
1   -8.0  0.950714 2022-02-25 2020-02-25
2   -6.0  0.731994 2022-02-26 2020-02-26
3   -4.0  0.598658 2022-02-27 2020-02-27
4   -2.0  0.156019 2022-02-28 2020-02-28
5    0.0  0.155995 2022-03-01 2020-02-29
6    2.0  0.058084 2022-03-02 2020-03-01
7    4.0  0.866176 2022-03-03 2020-03-02
8    6.0  0.601115 2022-03-04 2020-03-03
9    8.0  0.708073 2022-03-05 2020-03-04
10  10.0  0.020584 2022-03-06 2020-03-05

Row and column index of this dataframe:

In [301]:
df.index, df.columns

(RangeIndex(start=0, stop=11, step=1),
 Index(['a', 'b', 'c', 'd'], dtype='object'))

What we haven't used yet is to use integers in `loc[]`. For example we want to take the first three rows from columns `a` and `c`.

In [302]:
df.loc[:5, ['a', 'c']]

      a          c
0 -10.0 2022-02-24
1  -8.0 2022-02-25
2  -6.0 2022-02-26
3  -4.0 2022-02-27
4  -2.0 2022-02-28
5   0.0 2022-03-01

Now let's come back to indexes.

In [303]:
df2 = df.loc[df['b'] > 0.5, :]
df2

     a         b          c          d
1 -8.0  0.950714 2022-02-25 2020-02-25
2 -6.0  0.731994 2022-02-26 2020-02-26
3 -4.0  0.598658 2022-02-27 2020-02-27
7  4.0  0.866176 2022-03-03 2020-03-02
8  6.0  0.601115 2022-03-04 2020-03-03
9  8.0  0.708073 2022-03-05 2020-03-04

In [304]:
df2.index

Int64Index([1, 2, 3, 7, 8, 9], dtype='int64')

Now the index is different. This is because we selected a few rows from the original dataframe.

So `loc[]` works flawlessly with `df`.  
It gets quirky if we start using it with `df2`.
Let's select columns `a` and `c` from first 5 rows from `df2`

In [305]:
df2.loc[:5, ['a', 'c']]

     a          c
1 -8.0 2022-02-25
2 -6.0 2022-02-26
3 -4.0 2022-02-27

We got 3 rows...
That's because of `df2.index`!
`.loc[]` will always look in indexes!

For example even though `df2` has 6 rows, the last has index 9, so we can select it with:

In [306]:
df2.loc[9, :]

a                    8.0
b               0.708073
c    2022-03-05 00:00:00
d    2020-03-04 00:00:00
Name: 9, dtype: object

Not being aware of this feature/forgetting about it is a common source of error.

So the question is how to solve
> select columns `a` and `c` from first 5 rows from `df2`
 
in the best way? We must understand the `.reset_index()` method.
It adds the index as a new column (or changes series into dataframe if we call `.reset_index()` on series).
Very often (after querying, sorting) we don't need this index, we just want a fresh one.

In [307]:
df2.reset_index()

   index    a         b          c          d
0      1 -8.0  0.950714 2022-02-25 2020-02-25
1      2 -6.0  0.731994 2022-02-26 2020-02-26
2      3 -4.0  0.598658 2022-02-27 2020-02-27
3      7  4.0  0.866176 2022-03-03 2020-03-02
4      8  6.0  0.601115 2022-03-04 2020-03-03
5      9  8.0  0.708073 2022-03-05 2020-03-04

In [308]:
# It's more common to use drop=True than the default
df2.reset_index(drop=True)

     a         b          c          d
0 -8.0  0.950714 2022-02-25 2020-02-25
1 -6.0  0.731994 2022-02-26 2020-02-26
2 -4.0  0.598658 2022-02-27 2020-02-27
3  4.0  0.866176 2022-03-03 2020-03-02
4  6.0  0.601115 2022-03-04 2020-03-03
5  8.0  0.708073 2022-03-05 2020-03-04

In [309]:
df2.reset_index(drop=True).loc[:5, ['a', 'c']]

     a          c
0 -8.0 2022-02-25
1 -6.0 2022-02-26
2 -4.0 2022-02-27
3  4.0 2022-03-03
4  6.0 2022-03-04
5  8.0 2022-03-05

Another peculiarity of `loc[]`, instead of 5 rows, we got 6.
Contrary to the regular indexing, it **includes** the last element!
So we have to do:

In [311]:
df2.reset_index(drop=True).head(5).loc[:, ['a', 'c']]

     a          c
0 -8.0 2022-02-25
1 -6.0 2022-02-26
2 -4.0 2022-02-27
3  4.0 2022-03-03
4  6.0 2022-03-04

Why it makes sense to include the last as well?
Think of the following example.
The question is 
> Show all characters that lived no more than Sam Gamgee

In [150]:
df_lotr = pd.read_csv("../data/lotr_data.csv")
df_lotr.set_index("Name", inplace=True)  # for some reason we have Name as an index
df_lotr

                 Race  Salary   Profession  Age of Death
Name
Bilbo Baggins  Hobbit   10000      Retired           131
Frodo Baggins  Hobbit   70000  Ring-bearer            53
Sam Gamgee     Hobbit   60000     Security           102
Aragorn         Human   60000     Security           210

In [151]:
df_lotr.sort_values("Age of Death").loc[:'Sam Gamgee']

                 Race  Salary   Profession  Age of Death
Name
Frodo Baggins  Hobbit   70000  Ring-bearer            53
Sam Gamgee     Hobbit   60000     Security           102

As we see in the above example, the newly set index `Name` has a ... name. It's called `Name`.
Now if we do `.reset_index()` we will revert the `set_index` operation. We don't want to remove index column here.

In [153]:
df_lotr.sort_values("Age of Death").loc[:'Sam Gamgee'].reset_index()

            Name    Race  Salary   Profession  Age of Death
0  Frodo Baggins  Hobbit   70000  Ring-bearer            53
1     Sam Gamgee  Hobbit   60000     Security           102

One last example of `reset_index`.
The result of `df2.loc[9, :]` is a series, even though it doesn't make logically sense here, we can do the `reset_index`.
This will change a series into a dataframe.
It doesn't make logical sense as each column of dataframe should have a well-defined type, and here we have mix of int, float and date.

In [156]:
df2.loc[9, :].reset_index()

  index                    9
0     a                  8.0
1     b             0.708073
2     c  2022-03-05 00:00:00
3     d  2020-03-04 00:00:00